package net.vniia.skittles.templates;

import java.util.Arrays;
import java.util.List;

public class JokesTemplate {
    public static List<String> allJokes = Arrays.asList(
            "Идёт сеньор по офису. Видит, место тимлида освободилось. Сеньор сел на него и сгорел.",
            "Шел медведь по лофт-кофейне. Видит - калик стоит. Сел перед ним и сладко дунул. Это был Винни-Пых",
            "Так считали древние петербуржцы: ноль, стрелковый, едет кукушка, лесбушка, труп в однушке, солевичок, грибничок, режик в бочок, чувачок, смыть дурь в толчок",
            "Что говорит провинившийся карлик своим родителям? Я больше не буду",
            "Программист ложится спать и ставит рядом два стакана: один с водой, на случай, если захочет пить, другой - пустой, если не захочет",
            "Однажды айтишник сказал \"случай\" вместо \"кейс\", и у него отвалился бэкэнд",
            "В чем разница между физиком и курицей гриль? Курица гриль может прокормить семью",
            "Как называется ворона, севшая на оголенные провода? Электрокар",
            "Что общего между твоим членом и слепым? Оба не могут встать без собаки",
            "В дверь постучали \n Охуеть, - подумал Гагарин"
    );
}
