package net.vniia.skittles.templates;

import java.util.Arrays;
import java.util.List;

public class VacancyTemplate {
    public static List<String> allPositionNames = Arrays.asList(
            "Программист",
            "Уборщик",
            "Повар",
            "Охранник",
            "Водитель",
            "Бухгалтер",
            "Электрик",
            "Монтер",
            "Слесарь",
            "Токарь",
            "Курьер"
    );

    public static List<String> allVacancyAdditional = Arrays.asList(
            "Более 1 года опыта разработки на Java/Kotlin. Навыки разработки на одном из фреймворков: SpringBoot. Умение работать с SQL базами данных. Знание основных структур данных языка и их особенностей.",
            "Поддержание чистоты рабочих мест, санузлов, влажная уборка, вынос мусора, один раз в год мойка окон",
            "Опыт работы на азиатской кухни обязателен",
            "Опыт работы на аналогичных объектах приветствуется. Наличие действующего удостоверения на ЧОД желательно. Наличие классического костюма либо формы - приветствуется",
            "Своя машина представительского класса. Следить за состоянием автомобиля",
            "Стаж работы не менее 5-х лет, знание всех счетов учета",
            "Высшее или среднее профессиональное образование электрика. Действующая группа по электрической безопасности не ниже III",
            "Опыт работы с электроинструментом, электрооборудованием и газовым оборудованием. Образование техническое (желательно)",
            "Желательно иметь опыт работы на производстве конструкций из алюминиевых или пластиковых профилей",
            "Умение работать с индикаторный стойкой. Умение протачивать канавки (внутренние и наружные). Умение нарезать резьбы (метрический, трубные, конические)",
            "Готовность к физической нагрузке и желание стабильного дохода"
    );

    public static List<String> allVacancyPositionCoverLetter = Arrays.asList(
            "Я такой крутой, такой крутой!",
            "Готов стать админом вашей хуйни",
            "Сопроводительные письма презираю",
            "Хочу работать у вас!"
    );

    public static List<String> allCompetencesNames = Arrays.asList(
            "Soft Skills",
            "Навык работы со станком",
            "Знание английского языка",
            "Java Core",
            "Высшее образование",
            "Спортивный разряд",
            "Опыт работы с k8s",
            "Знание веб-фреймворка",
            "Красота"
    );
}
