package net.vniia.skittles.templates;

import java.util.Arrays;
import java.util.List;

public class VacancyTemplate {
    public static List<String> allPositionNames = Arrays.asList(
            "Программист",
            "Уборщик",
            "Повар",
            "Охранник",
            "Водитель",
            "Бухгалтер",
            "Электрик",
            "Монтер",
            "Слесарь",
            "Токарь",
            "Курьер"
    );

    public static List<String> allVacancyAdditional = Arrays.asList(
            "Более 1 года опыта разработки на Java/Kotlin. Навыки разработки на одном из фреймворков: SpringBoot. Умение работать с SQL базами данных. Знание основных структур данных языка и их особенностей.",
            "Поддержание чистоты рабочих мест, санузлов, влажная уборка, вынос мусора, один раз в год мойка окон",
            "Опыт работы на азиатской кухни обязателен",
            "Опыт работы на аналогичных объектах приветствуется. Наличие действующего удостоверения на ЧОД желательно. Наличие классического костюма либо формы - приветствуется",
            "Своя машина представительского класса. Следить за состоянием автомобиля",
            "Стаж работы не менее 5-х лет, знание всех счетов учета",
            "Высшее или среднее профессиональное образование электрика. Действующая группа по электрической безопасности не ниже III",
            "Опыт работы с электроинструментом, электрооборудованием и газовым оборудованием. Образование техническое (желательно)",
            "Желательно иметь опыт работы на производстве конструкций из алюминиевых или пластиковых профилей",
            "Умение работать с индикаторный стойкой. Умение протачивать канавки (внутренние и наружные). Умение нарезать резьбы (метрический, трубные, конические)",
            "Готовность к физической нагрузке и желание стабильного дохода"
    );

    public static List<String> allVacancyRespondCoverLetter = Arrays.asList(
            "Сопроводительное письмо",
            "Хочу работать у вас!"
    );

    public static List<String> allVacancyRespondPaths = Arrays.asList(
            "https://math-ege.sdamgia.ru/pdf/98736f0a673a970fac4f0ecb37c50abd.pdf",
            "https://math-ege.sdamgia.ru/pdf/e72e98fbf9722fc9de07e6eaea1e3fc5.pdf",
            "https://math-ege.sdamgia.ru/pdf/1b87c54f8314b6c5f0d337af63542cc7.pdf",
            "https://math-ege.sdamgia.ru/pdf/481983c31e9e7fed33746e8ae6f8f358.pdf"
    );

    public static List<String> allVacancyRespondFullNames = Arrays.asList(
            "Иван Иванович Иванов",
            "Евгений Иванович Забабахин",
            "Julius Robert Oppenheimer"
    );

    public static List<String> allCompetencesNames = Arrays.asList(
            "Soft Skills",
            "Навык работы со станком",
            "Знание английского языка",
            "Java Core",
            "Высшее образование",
            "Спортивный разряд",
            "Опыт работы с k8s",
            "Знание веб-фреймворка",
            "Красота"
    );

    public static List<String> allCompetencesGroupNames = Arrays.asList(
            "Коммуникационные",
            "Навыки работы в команде",
            "Навыки управления временем",
            "Технические навыки"
    );

    public static List<String> first = Arrays.asList(
            "Умение выражать свои мысли четко и понятно",
            "Слушать собеседника",
            "Задавать правильные вопросы",
            "Использовать невербальные средства коммуникации (жесты, мимика и т.д.)."
    );
    public static List<String> second = Arrays.asList(
            "Способность работать в команде",
            "Сотрудничество с коллегами",
            "Появление инициативы",
            "Помощь другим в достижении общей целей"
    );

    public static List<String> third = Arrays.asList(
            "Способность планировать свою работу",
            "Управление своим временем",
            "Соблюдение сроков выполнение задач вовремя"
    );
    public static List<String> fourth = Arrays.asList(
            "Умение использовать определенное программное обеспечение",
            "Знание языков программирования",
            "Знание технологий"
    );


}
